---
kind: property
id: P:Autodesk.Revit.DB.MEPCalculationServerInfo.PipeUseDefinitionOnTypeGUID
source: html/59062e4d-c3dc-8437-e5fe-cddaa7a0cf21.htm
---
# Autodesk.Revit.DB.MEPCalculationServerInfo.PipeUseDefinitionOnTypeGUID Property

The guid value ("3BF616F9-6B98-4A21-80FF-DA1120C8F6D6") of Use Definition On Type. It is not a server id, but a guid to tell if the loss method is "Use Definition On Type" or not.
 If the loss method is "Use Definition On Type", we use the loss method of the family type to calculate.

## Syntax (C#)
```csharp
public static Guid PipeUseDefinitionOnTypeGUID { get; }
```